{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"job_task_inp:0": {"name": "job_task_inp:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "soc1980_inp:0": {"name": "soc1980_inp:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "665"}]}}, "job_title_inp:0": {"name": "job_title_inp:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "840"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/xwtt/title_m1/title_h1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/title_h1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "665"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/xwtt/concatenate_7/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/xwtt/s2010_6d_outout/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2520"}, {"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "job_task_inp", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}}}, {"name": "job_title_inp", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "soc1980_inp", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "665"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h1/Relu", "op": "_FusedMatMul", "input": ["job_task_inp", "StatefulPartitionedCall/xwtt/task_m1/task_h1/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/task_m1/task_h1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/title_h1/Relu", "op": "_FusedMatMul", "input": ["job_title_inp", "StatefulPartitionedCall/xwtt/title_m1/title_h1/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/title_m1/title_h1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/Cast", "op": "Cast", "input": ["soc1980_inp"], "attr": {"Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/xwtt/task_m1/task_h1/Relu", "StatefulPartitionedCall/xwtt/task_m1/task_h2/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/task_m1/task_h2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/xwtt/title_m1/title_h1/Relu", "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/Cast", "op": "Cast", "input": ["StatefulPartitionedCall/xwtt/soc1980_xw2_1/Cast"], "attr": {"DstT": {"type": "DT_FLOAT"}, "SrcT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/xwtt/task_m1/task_h2/Relu", "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/Cast", "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/Relu", "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/MatMul/ReadVariableOp", "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/xwtt/concatenate_7/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/BiasAdd", "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/BiasAdd", "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/BiasAdd", "StatefulPartitionedCall/xwtt/concatenate_7/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/xwtt/concatenate_7/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/xwtt/s2010_6d_outout/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/Sigmoid", "StatefulPartitionedCall/xwtt/s2010_6d_outout/MatMul/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/xwtt/s2010_6d_outout/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "StatefulPartitionedCall/xwtt/title_m1/title_h1/MatMul/ReadVariableOp", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/title_m1/title_h1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/MatMul/ReadVariableOp", "shape": [1024, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/title_m1/soc2010_6d_out/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h1/MatMul/ReadVariableOp", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h2/MatMul/ReadVariableOp", "shape": [1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/task_h2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/MatMul/ReadVariableOp", "shape": [512, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/task_m1/soc2010_6d_out/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/MatMul/ReadVariableOp", "shape": [665, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc1980_4d_encoder/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/MatMul/ReadVariableOp", "shape": [128, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/soc1980_xw2_1/soc2010_6d_decoder/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/xwtt/concatenate_7/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/xwtt/s2010_6d_outout/MatMul/ReadVariableOp", "shape": [2520, 840], "dtype": "float32"}]}]}