{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"task:0": {"name": "task:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "job_title_inp:0": {"name": "job_title_inp:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "soc1980_4d_inp:0": {"name": "soc1980_4d_inp:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "665"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "840"}]}}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/test1/soc2010_out/Mul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "665"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/test1/title_h1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/title_h1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/task_h1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/test1/task_h1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/test1/task_h2/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/test1/task_h2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "840"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "job_title_inp", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "soc1980_4d_inp", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "665"}]}}, "dtype": {"type": "DT_INT32"}}}, {"name": "task", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "512"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/title_h1/Relu", "op": "_FusedMatMul", "input": ["job_title_inp", "StatefulPartitionedCall/test1/title_h1/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/title_h1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/Cast", "op": "Cast", "input": ["soc1980_4d_inp"], "attr": {"SrcT": {"type": "DT_INT32"}, "DstT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/task_h1/Relu", "op": "_FusedMatMul", "input": ["task", "StatefulPartitionedCall/test1/task_h1/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/task_h1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/test1/title_h1/Relu", "StatefulPartitionedCall/test1/title_soc2010_6d_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/title_soc2010_6d_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/test1/soc1980_4d_encoder/Cast", "StatefulPartitionedCall/test1/soc1980_4d_encoder/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/soc1980_4d_encoder/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/task_h2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/test1/task_h1/Relu", "StatefulPartitionedCall/test1/task_h2/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/task_h2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/test1/title_soc2010_6d_out/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/test1/soc1980_4d_encoder/Relu", "StatefulPartitionedCall/test1/soc2010_6d_decoder/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/soc2010_6d_decoder/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/test1/task_h2/Relu", "StatefulPartitionedCall/test1/task_soc2010_6d_out/MatMul/ReadVariableOp", "StatefulPartitionedCall/test1/task_soc2010_6d_out/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/test1/soc2010_6d_decoder/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/test1/task_soc2010_6d_out/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/stack", "op": "Pack", "input": ["StatefulPartitionedCall/test1/soc2010_6d_decoder/Sigmoid", "StatefulPartitionedCall/test1/title_soc2010_6d_out/Sigmoid", "StatefulPartitionedCall/test1/task_soc2010_6d_out/Sigmoid"], "attr": {"axis": {"i": "1"}, "N": {"i": "3"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/test1/soc2010_out/Mul/ReadVariableOp", "StatefulPartitionedCall/test1/soc2010_out/stack"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/test1/soc2010_out/Mul", "StatefulPartitionedCall/test1/soc2010_out/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/test1/soc2010_out/Sum", "StatefulPartitionedCall/test1/soc2010_out/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/test1/soc2010_out/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/test1/soc2010_out/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/test1/soc2010_out/Mul/ReadVariableOp", "shape": [3, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/MatMul/ReadVariableOp", "shape": [665, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/soc1980_4d_encoder/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/MatMul/ReadVariableOp", "shape": [128, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/soc2010_6d_decoder/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/title_h1/MatMul/ReadVariableOp", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/title_h1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/MatMul/ReadVariableOp", "shape": [1024, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/title_soc2010_6d_out/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_h1/MatMul/ReadVariableOp", "shape": [512, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_h1/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_h2/MatMul/ReadVariableOp", "shape": [1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_h2/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/MatMul/ReadVariableOp", "shape": [512, 840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/task_soc2010_6d_out/BiasAdd/ReadVariableOp", "shape": [840], "dtype": "float32"}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Sum/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/test1/soc2010_out/Add/ReadVariableOp", "shape": [840], "dtype": "float32"}]}]}